[
  {
    "fullName": "Jane Austen",
    "dob": "1775-12-16T00:00:00.000Z",
    "bio": "Jane Austen was an English novelist known for her six major novels, including 'Pride and Prejudice' and 'Sense and Sensibility'. Her works comment on the British landed gentry at the end of the 18th century.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3f", "60f1b6c5f0b45a1c9a7f7b3g"]
  },
  {
    "fullName": "George Orwell",
    "dob": "1903-06-25T00:00:00.000Z",
    "bio": "George Orwell was an English novelist, essayist, and journalist, best known for his works '1984' and 'Animal Farm', which critique totalitarian regimes and social injustice.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3h", "60f1b6c5f0b45a1c9a7f7b3i"]
  },
  {
    "fullName": "J.K. Rowling",
    "dob": "1965-07-31T00:00:00.000Z",
    "bio": "J.K. Rowling is a British author, best known for creating the 'Harry Potter' series, which became a global phenomenon in both literature and film.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3j", "60f1b6c5f0b45a1c9a7f7b3k"]
  },
  {
    "fullName": "Mark Twain",
    "dob": "1835-11-30T00:00:00.000Z",
    "bio": "Mark Twain, an American writer and humorist, is known for his novels 'The Adventures of Tom Sawyer' and 'Adventures of Huckleberry Finn', which reflect the social and political realities of 19th-century America.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3l", "60f1b6c5f0b45a1c9a7f7b3m"]
  },
  {
    "fullName": "Agatha Christie",
    "dob": "1890-09-15T00:00:00.000Z",
    "bio": "Agatha Christie was an English writer of crime novels, short stories, and plays. She is best known for creating detective characters Hercule Poirot and Miss Marple.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3n", "60f1b6c5f0b45a1c9a7f7b3o"]
  },
  {
    "fullName": "F. Scott Fitzgerald",
    "dob": "1896-09-24T00:00:00.000Z",
    "bio": "F. Scott Fitzgerald was an American novelist, widely regarded as one of the greatest writers of the 20th century. His novel 'The Great Gatsby' critiques the American Dream during the Roaring Twenties.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3p", "60f1b6c5f0b45a1c9a7f7b3q"]
  },
  {
    "fullName": "Haruki Murakami",
    "dob": "1949-01-12T00:00:00.000Z",
    "bio": "Haruki Murakami is a Japanese novelist and translator, known for his surrealist and postmodern works like 'Norwegian Wood' and '1Q84'. His books often explore themes of loneliness, existentialism, and the supernatural.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3r", "60f1b6c5f0b45a1c9a7f7b3s"]
  },
  {
    "fullName": "Charles Dickens",
    "dob": "1812-02-07T00:00:00.000Z",
    "bio": "Charles Dickens was an English writer and social critic, famous for his novels 'A Tale of Two Cities', 'Great Expectations', and 'Oliver Twist'. His works highlight social issues, including poverty and injustice.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3t", "60f1b6c5f0b45a1c9a7f7b3u"]
  },
  {
    "fullName": "Toni Morrison",
    "dob": "1931-02-18T00:00:00.000Z",
    "bio": "Toni Morrison was an American novelist known for her works exploring the African-American experience. Her notable works include 'Beloved' and 'Song of Solomon'. She received the Nobel Prize in Literature in 1993.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3v", "60f1b6c5f0b45a1c9a7f7b3w"]
  },
  {
    "fullName": "Hemingway",
    "dob": "1899-07-21T00:00:00.000Z",
    "bio": "Ernest Hemingway was an American novelist and short story writer, awarded the Nobel Prize in Literature in 1954. His works, such as 'The Old Man and the Sea' and 'A Farewell to Arms', reflect themes of courage, loss, and human endurance.",
    "books": ["60f1b6c5f0b45a1c9a7f7b3x", "60f1b6c5f0b45a1c9a7f7b3y"]
  }
]
